docs/notes/webassembly.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>WebAssembly</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">WebAssembly</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge73eba0">What Is WebAssembly?</a>
<ul>
<li><a href="#orga694118">WebAssmbly vs Javascript</a>
<ul>
<li><a href="#orgfdb8efb">Interpreters</a></li>
<li><a href="#orgeade553">Bytcode as a Compilation Target</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2a1a2d3">wat, wasm, and wast</a></li>
<li><a href="#org4a77ae6">Tooling</a></li>
<li><a href="#org8a548c5">Runtimes</a></li>
<li><a href="#org0a27e59">Hello World</a></li>
<li><a href="#org8540117">Text/Binary Conversion</a>
<ul>
<li><a href="#org43aa9e6">From wat (text) to wasm (binary)</a></li>
<li><a href="#orga08e298">From wasm to wat</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orge73eba0" class="outline-2">
<h2 id="orge73eba0"><a href="#orge73eba0">What Is WebAssembly?</a></h2>
<div class="outline-text-2" id="text-orge73eba0">
<p>
Mostly, WebAssembly is a specification (<a href="https://webassembly.github.io/spec/core/">here</a>) for a bytecode format (i.e. a
<i>virtual instruction set architecture</i>) for a virtual stack machine. See <a href="https://youtu.be/2qV-1JhxWeE?t=175">here</a>
for an intro to virtual stack machines.
</p>

<p>
Just like many other programming languages (Python, Ruby, every JVM language),
the idea is that a virtual machine interprets the bytecode. These days
browsers include such a VM, as does NodeJS.
</p>

<p>
A WebAssembly virtual machine has some important differences from other
popular language virtual machines:
</p>

<ul class="org-ul">
<li>Host Environment.</li>
<li>Security Model.</li>
</ul>
</div>

<div id="outline-container-orga694118" class="outline-3">
<h3 id="orga694118"><a href="#orga694118">WebAssmbly vs Javascript</a></h3>
<div class="outline-text-3" id="text-orga694118">
</div>
<div id="outline-container-orgfdb8efb" class="outline-4">
<h4 id="orgfdb8efb"><a href="#orgfdb8efb">Interpreters</a></h4>
<div class="outline-text-4" id="text-orgfdb8efb">
<p>
There are a couple existing Javascript intepreters:
</p>

<ul class="org-ul">
<li><a href="https://v8.dev/">V8</a> (Chrome, NodeJS)</li>
<li><a href="https://spidermonkey.dev/">SpiderMonkey</a> (FireFox)</li>
<li><a href="https://trac.webkit.org/wiki/JavaScriptCore">JavaScriptCore</a> (Safari)</li>
</ul>

<p>
So, there's a V8 team at Google who created their own interpreter for
Javascript. They invented a bytecode format and implemented a VM
(incidentally, a register machine) that executes the bytecode.
</p>

<p>
V8 scans and parses Javascript code (into an AST) and then generates
bytecode. The interpreter evaluates the bytecodes using C functions. The
bytecode form of the program can't be shared for execution in other browsers,
since it only works in V8; instead, sharing the program means sharing the
Javascript (which is fine, just slightly slower to load and execute).
</p>

<p>
A WebAssembly VM could execute a program that has been pre-compiled into
WebAssembly bytecode.
</p>

<p>
Since a whole new VM is required, WebAssembly is also an opportunity to
revisit every single design decision about Javascript to make it better for
running in browsers.
</p>
</div>
</div>

<div id="outline-container-orgeade553" class="outline-4">
<h4 id="orgeade553"><a href="#orgeade553">Bytcode as a Compilation Target</a></h4>
<div class="outline-text-4" id="text-orgeade553">
<p>
Bytecode is a nicer compilation target than a high-level textual language
like Javascript. While there have been many tools to transpile various
languages into Javascript, it is easier to create tools that compile those
languages to WebAssembly bytecode.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org2a1a2d3" class="outline-2">
<h2 id="org2a1a2d3"><a href="#org2a1a2d3">wat, wasm, and wast</a></h2>
<div class="outline-text-2" id="text-org2a1a2d3">
<ul class="org-ul">
<li><code>wat</code>: is the textual format (lisp)</li>
<li><code>wasm</code>: the binary format</li>
<li><code>wast</code>: ??</li>
<li><code>wasi</code> - An API spec for talking to an OS. Much like POSIX. Needed/used only
when running outside of a browser, because browsers define their own
complete API for what is possible. See: <a href="https://wasi.dev/">wasi.dev</a>.</li>
</ul>

<p>
Also, "wasm" is sometimes used to abbreviate "WebAssembly", as in: "the wasm
text format and the wasm binary format".
</p>
</div>
</div>

<div id="outline-container-org4a77ae6" class="outline-2">
<h2 id="org4a77ae6"><a href="#org4a77ae6">Tooling</a></h2>
<div class="outline-text-2" id="text-org4a77ae6">
<ul class="org-ul">
<li><p>
<a href="https://github.com/webassembly/wabt">wabt</a>, the WebAssembly Binary Toolkit.
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install wabt
</pre>
</div></li>

<li>Emscripten: LLVM backend for wasm</li>

<li><a href="https://mbebenita.github.io/WasmExplorer/">WasmExplorer</a> - Website where you can programs to WebAssembly and view them.</li>

<li>WasmFiddle</li>
</ul>
</div>
</div>

<div id="outline-container-org8a548c5" class="outline-2">
<h2 id="org8a548c5"><a href="#org8a548c5">Runtimes</a></h2>
<div class="outline-text-2" id="text-org8a548c5">
<p>
The <a href="https://webassembly.org/roadmap/">roadmap</a> lists three non-browser runtimes:
</p>

<ul class="org-ul">
<li>Node.js</li>
<li>Wasmtime</li>
<li>Wasmer</li>
</ul>
</div>
</div>

<div id="outline-container-org0a27e59" class="outline-2">
<h2 id="org0a27e59"><a href="#org0a27e59">Hello World</a></h2>
<div class="outline-text-2" id="text-org0a27e59">
<div class="org-src-container">
<pre class="src src-wat"><span style="color: #51afef;">(</span><span style="color: #51afef;">module</span>
 <span style="color: #c678dd;">(</span><span style="color: #51afef;">func</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">export</span> <span style="color: #98be65;">"AddInt"</span><span style="color: #98be65;">)</span>
       <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">param</span> <span style="color: #dcaeea;">$value_1</span><span style="color: #ECBE7B;"> i32</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">param</span> <span style="color: #dcaeea;">$value_2</span><span style="color: #ECBE7B;"> i32</span><span style="color: #98be65;">)</span>
       <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">result i32</span><span style="color: #98be65;">)</span>
       <span style="color: #c678dd;">local.get</span> <span style="color: #dcaeea;">$value_1</span>
       <span style="color: #c678dd;">local.get</span> <span style="color: #dcaeea;">$value_2</span>
       <span style="color: #c678dd;">i32.add</span>
       <span style="color: #c678dd;">)</span>
 <span style="color: #51afef;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">wat2wasm webassembly/AddInt.wat <span style="color: #98be65;">\</span>
         -o webassembly/AddInt.wasm
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Read wasm file</span>
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">fs</span> = require(<span style="color: #98be65;">'fs'</span>);
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">bytes</span> = fs.readFileSync(dir + <span style="color: #98be65;">"/AddInt.wasm"</span>);

WebAssembly.instantiate(<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Uint8Array</span>(bytes))
  .then(obj =&gt; {
    <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">result</span> = obj.instance.exports.AddInt(3, 4);
    console.log(<span style="color: #98be65;">`3 + 4 = ${result}`</span>);
  })
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
undefined3 + 4 = 7
</pre>
</div>
</div>

<div id="outline-container-org8540117" class="outline-2">
<h2 id="org8540117"><a href="#org8540117">Text/Binary Conversion</a></h2>
<div class="outline-text-2" id="text-org8540117">
</div>
<div id="outline-container-org43aa9e6" class="outline-3">
<h3 id="org43aa9e6"><a href="#org43aa9e6">From wat (text) to wasm (binary)</a></h3>
<div class="outline-text-3" id="text-org43aa9e6">
<p>
Tangle this to <code>simple.wat</code>.
</p>

<div class="org-src-container">
<pre class="src src-wat"><span style="color: #51afef;">(</span><span style="color: #51afef;">module</span>
 <span style="color: #c678dd;">(</span><span style="color: #51afef;">func</span> <span style="color: #dcaeea;">$i</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">import</span> <span style="color: #98be65;">"imports"</span> <span style="color: #98be65;">"imported_func"</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">param i32</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #51afef;">func</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">export</span> <span style="color: #98be65;">"exported_func"</span><span style="color: #98be65;">)</span>
       <span style="color: #c678dd;">i32.const</span> 42
       <span style="color: #c678dd;">call</span> <span style="color: #dcaeea;">$i</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Now run <code>wat2wasm</code> to produce a binary file called <code>simple.wasm</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">wat2wasm simple.wat -o simple.wasm
</pre>
</div>

<p>
Why is this writing to stderr?
</p>

<div class="org-src-container">
<pre class="src src-sh">wat2wasm simple.wat -v
</pre>
</div>

<pre class="example" id="orge21e053">
0000000: 0061 736d                                 ; WASM_BINARY_MAGIC
0000004: 0100 0000                                 ; WASM_BINARY_VERSION
; section "Type" (1)
0000008: 01                                        ; section code
0000009: 00                                        ; section size (guess)
000000a: 02                                        ; num types
; func type 0
000000b: 60                                        ; func
000000c: 01                                        ; num params
000000d: 7f                                        ; i32
000000e: 00                                        ; num results
; func type 1
000000f: 60                                        ; func
0000010: 00                                        ; num params
0000011: 00                                        ; num results
0000009: 08                                        ; FIXUP section size
; section "Import" (2)
0000012: 02                                        ; section code
0000013: 00                                        ; section size (guess)
0000014: 01                                        ; num imports
; import header 0
0000015: 07                                        ; string length
0000016: 696d 706f 7274 73                        imports  ; import module name
000001d: 0d                                        ; string length
000001e: 696d 706f 7274 6564 5f66 756e 63         imported_func  ; import field name
000002b: 00                                        ; import kind
000002c: 00                                        ; import signature index
0000013: 19                                        ; FIXUP section size
; section "Function" (3)
000002d: 03                                        ; section code
000002e: 00                                        ; section size (guess)
000002f: 01                                        ; num functions
0000030: 01                                        ; function 0 signature index
000002e: 02                                        ; FIXUP section size
; section "Export" (7)
0000031: 07                                        ; section code
0000032: 00                                        ; section size (guess)
0000033: 01                                        ; num exports
0000034: 0d                                        ; string length
0000035: 6578 706f 7274 6564 5f66 756e 63         exported_func  ; export name
0000042: 00                                        ; export kind
0000043: 01                                        ; export func index
0000032: 11                                        ; FIXUP section size
; section "Code" (10)
0000044: 0a                                        ; section code
0000045: 00                                        ; section size (guess)
0000046: 01                                        ; num functions
; function body 0
0000047: 00                                        ; func body size (guess)
0000048: 00                                        ; local decl count
0000049: 41                                        ; i32.const
000004a: 2a                                        ; i32 literal
000004b: 10                                        ; call
000004c: 00                                        ; function index
000004d: 0b                                        ; end
0000047: 06                                        ; FIXUP func body size
0000045: 08                                        ; FIXUP section size
</pre>
</div>
</div>

<div id="outline-container-orga08e298" class="outline-3">
<h3 id="orga08e298"><a href="#orga08e298">From wasm to wat</a></h3>
<div class="outline-text-3" id="text-orga08e298">
<p>
We can disassemble! Ain't that peachy!
</p>

<div class="org-src-container">
<pre class="src src-sh">wasm2wat simple.wasm
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(module
  (type (;0;) (func (param i32)))
  (type (;1;) (func))
  (import "imports" "imported_func" (func (;0;) (type 0)))
  (func (;1;) (type 1)
    i32.const 42
    call 0)
  (export "exported_func" (func 1)))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
